Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags
Polymesh check flags, please refer to PolymeshHealthCheckEnum for the corresponding result values.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.None
Perform no check

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.LoopVertexUnique
To check that no two consecutive vertex index may be the same.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.VerticesOnSameEdge
To check outerloop vertices on same edge, distance tolerance 0.01.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.OuterloopPlanarity
To check outerloop's planarity, IN_PLANE_EPSILON 1.0e-3.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.OuterloopSelfIntersection
To check if outerloop intersects itself, EPSILON 1.E-4

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.InnerloopPlanarity
To check innterloop's planarity, IN_PLANE_EPSILON 1.0e-3.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.InnerloopSelfIntersection
To check if innerloop intersects itself, EPSILON 1.E-4.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.InnerloopInsideOuterloop
To check if innerloop inside outerloop, EPSILON 1.E-4.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.LoopNormalValidity
The inner loop is oriented clockwise, the opposite of the outer loop (counterclockwise).

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.FaceEdgeOrientation
To check face's edge orientation.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.Multishellness
To check are there more than one topologically connected components in the polymesh.
This checks only through vertex indexes.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.MultishellnessGeometrical
To check are there more than one geometrically connected components in the polymesh.
Check with all vertex edge face position containment (includes partial edge touching cases).
This check can be slow, the behavior is O(n^2).

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.VerticesOnSamePosition
To check if there are any vertices that are in the same location, EPSILON 0.01.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.UnusedVertices
To check if there are any unused vertices in the vertex array.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.NonManifoldEdges
Are there non-manifold edges (indirect edge vertices are found for more than 2 faces).

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.NullFaces
To check if all vertices of the face are linearly dependent,
or having less than 3 vertices, or smaller than allowed edges.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.All
To check all criteria.